In [1]:
import pandas as pd
import numpy as np #importing numpy and pandas library

In [2]:
data = pd.read_csv('Salaries.csv') #reading csv file 
#note csv file must be in same directory of this file

C:\Users\User\AppData\Local\Temp\ipykernel_18424\2204027218.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('Salaries.csv') #reading csv file

In [3]:
data #retrived csv file

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [4]:
data.info() #getting the info of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [5]:
int_BasePay = data['BasePay'].replace(r'^([A-Za-z][0-9]|_)+$',np.nan)
#replacing string with null value

In [6]:
int_BasePay = int_BasePay.dropna()
#eliminating the null value

In [7]:
int_BasePay

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148049, dtype: object

In [8]:
int_BasePay = int_BasePay.replace('Not Provided',0)
#again replacing 'not provided' with 0

In [9]:
int_BasePay

0         167411.18
1         155966.02
2         212739.13
3           77916.0
4          134401.6
            ...
148649         0.00
148650            0
148651            0
148652            0
148653         0.00
Name: BasePay, Length: 148049, dtype: object

In [10]:
int_BasePay.astype(float).dropna().mean()
#here changing the object type data in float and droping null value and 
# getting the mean of column

66323.65685408209

In [11]:
data['OvertimePay'].replace('Not Provided',0).astype(float).max()

245131.88

In [12]:
data['JobTitle'].str.find('JOSEPH DRISCOLL')
# searching 'JOSEPH DRISCOLL' IN column JobTitle

0        -1
1        -1
2        -1
3        -1
4        -1
         ..
148649   -1
148650   -1
148651   -1
148652   -1
148653   -1
Name: JobTitle, Length: 148654, dtype: int64

In [13]:
data[data['EmployeeName'] == 'JOSEPH DRISCOLL']
#getting the whole data of employee joseph driscoll

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [14]:
data[data['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']
#getting the jobtitle of employee joseph driscoll

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [15]:
data[data['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']
#getting the total payment of the specific employee

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [16]:
data[data['TotalPay'] == data['TotalPayBenefits'].max()]
#getting the detail of highest paid employee

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [17]:
#more advanced method
data.iloc[data['TotalPayBenefits'].argmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [18]:
data[data['TotalPay'] == data['TotalPay'].max()]['EmployeeName']
#getting the detail of highest paid employee name

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [19]:
data[data['TotalPay'] == data['TotalPay'].min()]
#getting the detail of highest paid employee

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [20]:
data.iloc[data['TotalPayBenefits'].argmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                   0.00
OvertimePay                               0.00
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [21]:
float_basepay = data['BasePay'].replace('Not Provided',0).astype(float)
float_basepay
#changing obj into float

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [22]:
data.groupby('Year').mean()
#getting the average pay of employee according to year

C:\Users\User\AppData\Local\Temp\ipykernel_18424\2779571683.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby('Year').mean()

            Id      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  71744.103871      71744.103871    NaN
2012   54542.5  74113.262265     100553.229232    NaN
2013   91728.5  77611.443142     101440.519714    NaN
2014  129593.0  75463.918140     100250.918884    NaN

In [23]:
data.groupby('Year').mean()['TotalPay']
#only retriving Totalpay

C:\Users\User\AppData\Local\Temp\ipykernel_18424\2503764796.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [24]:
data['new'] = float_basepay
#adding float basepay as new column in data

In [25]:
data.groupby('Year').mean()['new']
# now retriving average of basepay in years 2011 - 2014

C:\Users\User\AppData\Local\Temp\ipykernel_18424\274346272.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby('Year').mean()['new']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66557.437750
Name: new, dtype: float64

In [26]:
data['JobTitle'].unique()
#getting the name of unique job title in data

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [27]:
data['JobTitle'].nunique()
#getting number of unique jobtitle in data

2159

In [28]:
data['JobTitle'].value_counts().head(5)
#getting the 5 most common jobs
#value counts helps to count the repetation of the value

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [29]:
sum(data[data['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [30]:
# now getting the list of the job title with word chief 
def find_chief(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False
    
find_chief('Chief director')

True

In [31]:
data['JobTitle'].apply(lambda x : find_chief(x))

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [32]:
#for getting the number of jobtitle which have word chief
sum(data['JobTitle'].apply(lambda x : find_chief(x)))

477

In [33]:
data['job_len'] = data['JobTitle'].apply(len)

In [34]:
data[['JobTitle', 'job_len']]

                                              JobTitle  job_len
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY       46
1                      CAPTAIN III (POLICE DEPARTMENT)       31
2                      CAPTAIN III (POLICE DEPARTMENT)       31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC       36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)       44
...                                                ...      ...
148649                                       Custodian        9
148650                                    Not provided       12
148651                                    Not provided       12
148652                                    Not provided       12
148653                      Counselor, Log Cabin Ranch       26

[148654 rows x 2 columns]

In [35]:
data['job_len']

0         46
1         31
2         31
3         36
4         44
          ..
148649     9
148650    12
148651    12
148652    12
148653    26
Name: job_len, Length: 148654, dtype: int64

In [36]:
data['job_len'].corr(data['TotalPayBenefits'])

-0.03687844593260676

In [37]:
data[['JobTitle','job_len']].corr()

C:\Users\User\AppData\Local\Temp\ipykernel_18424\1966889700.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  data[['JobTitle','job_len']].corr()

         job_len
job_len      1.0

In [38]:
data[['job_len','TotalPayBenefits']].corr()

                   job_len  TotalPayBenefits
job_len           1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000